In [1]:
import pandas as pd

In [31]:
df=pd.read_csv("../adv_python/pandas/Files/movies_cleaned_pandas.csv",names=["id","name","year","rating","duration"])
df.head(5)

   id                  name  year  rating  duration
0   2             The Mummy  1932     3.5    4388.0
1   3  Orphans of the Storm  1921     3.2    9062.0
2   4  The Object of Beauty  1991     2.8    6150.0
3   5            Night Tide  1963     2.8    5126.0
4   6   One Magic Christmas  1985     3.8    5333.0

### 1. Find row count

In [3]:
df.count()

id          49589
name        49589
year        49589
rating      49589
duration    49589
dtype: int64

### 2. Remove duplicates and find row count

In [4]:
df1=df.drop_duplicates()
df1.shape

(49589, 5)

### 3. Sort data set by release year in des order

In [5]:
df1=df.sort_values("year",ascending=False)["year"]
df1

49559    2014
43333    2013
45388    2013
45386    2013
45385    2013
         ...
608      1914
20056    1914
14326    1913
42663    1913
42669    1913
Name: year, Length: 49589, dtype: int64

### 4. Find rating mxm 5 movies name,year,rating

In [33]:
df1=df.sort_values(by="rating",ascending=False)[["name","year","rating"]].head(5)
df1

                                 name  year  rating
19398      The Walking Dead: Season 2  2011     4.5
33521              Sherlock: Series 2  2012     4.5
13313                    Breaking Bad  2008     4.5
44096  Arrested Development (Trailer)  2013     4.5
36257          Breaking Bad: Season 5  2012     4.5

### 5. Find rating minimum 3 movies name,year,rtaing

In [34]:
df1=df.sort_values(by="rating")[["name","year","rating"]].head(3)

df1

                      name  year  rating
42159  Sun Yaar Chill Maar  2007     1.4
40933               Lagegi  2007     1.4
40825               Lagegi  2007     1.4

### 6. Find Each year release movie count [count desc order]

In [8]:
df1=df.groupby("year")["year"].count().sort_values(ascending=False)
df1

year
2011    5511
2010    5107
2009    4451
2012    4339
2008    3358
        ...
1921       2
1918       1
1916       1
1915       1
2014       1
Name: year, Length: 101, dtype: int64

### 7. Each rating count [count desc order]

In [35]:
df1=df.groupby("rating")["rating"].count().sort_values(ascending=False)
df1.head()

rating
3.451207    38776
3.700000     1058
3.600000      967
3.800000      962
3.900000      859
Name: rating, dtype: int64

### 8. 2008 and rating above 3 [collect]

In [10]:
df1=df.loc[(df["rating"]>3)&(df["year"]==2008)]
df1.head(5)

,id,name,year,rating,duration
3187,3189,Elegy,2008,3.3,6727.0
3400,3402,Lipstick Jungle: Season 1,2008,3.1,2563.0
4000,4002,The Business of Being Born,2008,3.9,5089.0
4007,4009,Pirates Who Don't Do Anything: A VeggieTales M...,2008,3.7,5123.0
4015,4017,The Tale of Despereaux,2008,3.5,5607.0

###### A. row count

In [11]:
df1.count()

id          3254
name        3254
year        3254
rating      3254
duration    3254
dtype: int64

### 9. Find duration mxm 1 movies name,year,rating,duration

In [36]:
df1=df.sort_values(by="duration",ascending=False)[["name","year","rating","duration"]].head(1)
df1

                                       name  year  rating  duration
22215  Example 8 Hour 23.976 Remote Content  2010     3.0   28813.0

### 10. Find rating mnm 1 movies name,year,rating,duration

In [37]:
df1=df.sort_values(by="rating")[["name","year","rating","duration"]].head(1)
df1

                      name  year  rating  duration
42159  Sun Yaar Chill Maar  2007     1.4    2563.0

### 11. Rating above 4 and relase year above 2005

In [44]:
df1=df.loc[(df["rating"]>4)&(df["year"]>2005)]
df1

,id,name,year,rating,duration
2503,2505,Rang De Basanti,2006,4.1,9999.0
2605,2607,Freedom Writers,2007,4.1,7375.0
2656,2658,How I Met Your Mother: Season 2,2006,4.2,2563.0
2660,2662,Prison Break: Season 2,2006,4.2,2563.0
2661,2663,Bones: Season 2,2006,4.1,2563.0
...,...,...,...,...,...
49547,49549,Life With Boys: Season 1,2011,4.1,2563.0
49552,49554,Max Steel,2013,4.1,2563.0
49554,49556,Lilyhammer: Season 1 (Recap),2013,4.2,194.0
49569,49571,The Short Game (Trailer),2013,4.1,156.0
49577,49579,Transformers Prime Beast Hunters: Predacons Ri...,2013,4.2,3950.0

###### A. Rating mxm movies full data

In [45]:
df2=df1.sort_values(by="rating",ascending=False).head(1)
df2

          id                    name  year  rating  duration
14953  14955  Breaking Bad: Season 4  2011     4.5    2563.0

###### B. Rating mnm movies full data`

In [46]:
df2=df1.sort_values(by="rating").head(1)
df2

        id             name  year  rating  duration
2503  2505  Rang De Basanti  2006     4.1    9999.0

### 12. 2008 movies count

In [22]:
df1=df.loc[df["year"]==2008]
df1.count()

id          3358
name        3358
year        3358
rating      3358
duration    3358
dtype: int64

### 13. 1975-2000 movies collect

In [24]:
df1=df.loc[(df["year"]>=1975)&(df["year"]<=2000)]
df1

,id,name,year,rating,duration
2,4,The Object of Beauty,1991,2.800000,6150.0
4,6,One Magic Christmas,1985,3.800000,5333.0
5,7,Muriel's Wedding,1994,3.500000,6323.0
6,8,Mother's Boys,1994,3.400000,5733.0
8,10,Nick of Time,1995,3.400000,5333.0
...,...,...,...,...,...
47458,47460,Goosebumps: Specials: The Haunted Mask II - Pa...,1997,3.451207,1496.0
47460,47462,Goosebumps: Specials: The Night of the Living ...,1997,3.451207,1461.0
47463,47465,Goosebumps: Specials: The Haunted Mask II - Pa...,1997,3.451207,1379.0
48866,48868,The Phoenix and the Magic Carpet,1995,2.500000,5337.0
49580,49582,Mumfie's White Christmas,1996,2.400000,1350.0

###### A. Row count

In [25]:
df1.count()

id          10747
name        10747
year        10747
rating      10747
duration    10747
dtype: int64

### 14. 1975-2000 and rating above 3.5 total row count

In [28]:
df1=df.loc[(df["year"]>=1975)&(df["year"]<=2000)&(df["rating"]>3.5)]
df1

          id                            name  year  rating  duration
4          6             One Magic Christmas  1985     3.8    5333.0
10        12                       Big Night  1996     3.6    6561.0
12        14            The Boys from Brazil  1978     3.6    7417.0
14        16              The Breakfast Club  1985     4.0    5823.0
17        19                   Bustin' Loose  1981     3.7    5598.0
...      ...                             ...   ...     ...       ...
47286  47288            Goosebumps: Specials  1997     3.8    2563.0
47291  47293            Goosebumps: Season 4  1998     3.8    2563.0
47414  47416  The Magic School Bus: Season 4  1997     3.9    2563.0
47428  47430  The Magic School Bus: Season 3  1996     3.9    2563.0
47455  47457  The Magic School Bus: Season 2  1995     3.9    2563.0

[937 rows x 5 columns]